RT-Thread-packages/gd32-arm-series/GD32H77x_78x/GD32H77x_78x_standard_peripheral/Source/gd32h77x_78x_cau_aes.c
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_VALID_POINTER(cau_parameter)) {
        fw_debug_report_err(CAU_MODULE_ID, API_ID(0x001CU), ERR_PARAM_POINTER);
    } else if(NOT_VALID_POINTER(mac)) {
        fw_debug_report_err(CAU_MODULE_ID, API_ID(0x001CU), ERR_PARAM_POINTER);
    } else if(NOT_VALID_POINTER(cau_parameter->key)) {
        fw_debug_report_err(CAU_MODULE_ID, API_ID(0x001CU), ERR_PARAM_POINTER);
    } else if(NOT_VALID_POINTER(cau_parameter->input)) {
        fw_debug_report_err(CAU_MODULE_ID, API_ID(0x001CU), ERR_PARAM_POINTER);
    } else
#endif
    {
        
        /* key structure initialization */
        cau_key_struct_para_init(&key_initpara);
        /* AES key structure parameter config */
        cau_aes_key_config(cau_parameter->key, cau_parameter->key_size, &key_initpara);
        /* key initialization */
        cau_key_init(&key_initpara);
        /* initialize the CAU peripheral */
        cau_init(cau_parameter->alg_dir, CAU_MODE_AES_CMAC, CAU_SWAPPING_8BIT, cau_parameter->key_select);

        /* vectors initialization */
        iv_initpara.iv_0_high = __REV(0x00000000U);
        iv_initpara.iv_0_low  = __REV(0x00000000U);
        iv_initpara.iv_1_high = __REV(0x00000000U);
        iv_initpara.iv_1_low  = __REV(0x00000000U);
        cau_iv_init(&iv_initpara);

        /*========================= prepare phase=========================*/
        /* select prepare phase */
        cau_phase_config(CAU_PREPARE_PHASE);
        /* enable the CAU peripheral */
        cau_enable();
        /* wait for CAUEN bit to be 0 */
        while(ENABLE == cau_enable_state_get()) {
        }

        /*======================== generate mac phase===================*/
        /* Select init phase */
        cau_phase_config(CAU_AAD_PHASE);
        /* flush the IN and OUT FIFOs */
        cau_fifo_flush();
        /* enable the CAU peripheral */
        cau_enable();

        if((uint32_t)0 != inputsize) {
            ret = cau_fill_data((uint8_t *)inputaddr, inputsize);
        } else {
            /* only one block, fill the remaining bits with zero */
            uint32_t block_data_temp[4] = {0x0};
            inputaddr = (uint32_t)block_data_temp;
            /* if CMAC encryption, then configurate NBPILB bits and CAU_CTL_CMACFB bit in CTL register */
            temp0 = CAU_CTL & CAU_CTL_GCM_CCMPH;
            temp1 = CAU_CTL & CAU_CTL_ALGM;
            temp2 = CAU_CTL & CAU_CTL_CAUDIR;
            if((CAU_AAD_PHASE == temp0) && (CAU_MODE_AES_CMAC == temp1) && (CAU_ENCRYPT == temp2)) {
                CAU_CTL |= CAU_PADDING_BYTES(16);
                CAU_CTL |= CAU_CTL_CMACFB;
            }
            /* write data to the IN FIFO */
            cau_data_write(*(uint32_t *)(inputaddr));
            inputaddr += 4U;
            cau_data_write(*(uint32_t *)(inputaddr));
            inputaddr += 4U;
            cau_data_write(*(uint32_t *)(inputaddr));
            inputaddr += 4U;
            cau_data_write(*(uint32_t *)(inputaddr));
        }

        if(ERROR != ret) {
            /* wait until the ONE flag is set */
            while(RESET == cau_flag_get(CAU_FLAG_OUTFIFO_NO_EMPTY)) {
            }

            /* read the tag in the OUT FIFO */
            temp_mac[0U] = cau_data_read();
            temp_mac[1U] = cau_data_read();
            temp_mac[2U] = cau_data_read();
            temp_mac[3U] = cau_data_read();

            /* disable the CAU peripheral */
            cau_disable();

            /* cut output in mac size */
            for(i = 0U; i < mac_size; i++) {
                word_index = i / 4U;
                byte_index = i % 4U;
                mac[i] = (uint8_t)(temp_mac[word_index] >> (byte_index * 8U));
            }
        }
    }

    return ret;
}

/*!
    \brief      AES key structure parameter config
    \param[in]  key: key used for AES algorithm
    \param[in]  keysize: length of the key in bits, must be either 128, 192 or 256
    \param[out] cau_key_initpara: key init parameter struct
                  key_0_high: key 0 high
                  key_0_low:  key 0 low
                  key_1_high: key 1 high
                  key_1_low:  key 1 low
                  key_2_high: key 2 high
                  key_2_low:  key 2 low
                  key_3_high: key 3 high
                  key_3_low:  key 3 low
    \retval     none
*/
static void cau_aes_key_config(uint8_t *key, uint32_t keysize, cau_key_parameter_struct *cau_key_initpara)
{
    uint32_t keyaddr = (uint32_t)key;

    switch(keysize) {
    /* 128-bit key initialization */
    case 128:
        cau_aes_keysize_config(CAU_KEYSIZE_128BIT);
        cau_key_initpara->key_2_high = __REV(*(uint32_t *)(keyaddr));
        keyaddr += 4U;
        cau_key_initpara->key_2_low  = __REV(*(uint32_t *)(keyaddr));
        keyaddr += 4U;
        cau_key_initpara->key_3_high = __REV(*(uint32_t *)(keyaddr));
        keyaddr += 4U;
        cau_key_initpara->key_3_low  = __REV(*(uint32_t *)(keyaddr));
        break;
    /* 192-bit key initialization */
    case 192:
        cau_aes_keysize_config(CAU_KEYSIZE_192BIT);
        cau_key_initpara->key_1_high = __REV(*(uint32_t *)(keyaddr));
        keyaddr += 4U;
        cau_key_initpara->key_1_low  = __REV(*(uint32_t *)(keyaddr));
        keyaddr += 4U;
        cau_key_initpara->key_2_high = __REV(*(uint32_t *)(keyaddr));
        keyaddr += 4U;
        cau_key_initpara->key_2_low  = __REV(*(uint32_t *)(keyaddr));
        keyaddr += 4U;
        cau_key_initpara->key_3_high = __REV(*(uint32_t *)(keyaddr));
        keyaddr += 4U;
        cau_key_initpara->key_3_low  = __REV(*(uint32_t *)(keyaddr));
        break;
    /* 256-bit key initialization */
    case 256:
        cau_aes_keysize_config(CAU_KEYSIZE_256BIT);
        cau_key_initpara->key_0_high = __REV(*(uint32_t *)(keyaddr));
        keyaddr += 4U;
        cau_key_initpara->key_0_low  = __REV(*(uint32_t *)(keyaddr));
        keyaddr += 4U;
        cau_key_initpara->key_1_high = __REV(*(uint32_t *)(keyaddr));
        keyaddr += 4U;
        cau_key_initpara->key_1_low  = __REV(*(uint32_t *)(keyaddr));
        keyaddr += 4U;
        cau_key_initpara->key_2_high = __REV(*(uint32_t *)(keyaddr));
        keyaddr += 4U;
        cau_key_initpara->key_2_low  = __REV(*(uint32_t *)(keyaddr));
        keyaddr += 4U;
        cau_key_initpara->key_3_high = __REV(*(uint32_t *)(keyaddr));
        keyaddr += 4U;
        cau_key_initpara->key_3_low  = __REV(*(uint32_t *)(keyaddr));
        break;
    default:
        break;
    }
}

/*!
    \brief      fill data into data input register
    \param[in]  input: pointer to the input buffer
    \param[in]  in_length: length of the input buffer in bytes, must be a multiple of 16 bytes
    \retval     ErrStatus: SUCCESS or ERROR
*/
static ErrStatus cau_fill_data(uint8_t *input, uint32_t in_length)
{
    uint32_t inputaddr  = (uint32_t)input;
    uint32_t i = 0U;
    __IO uint32_t counter = 0U;
    uint32_t busystatus = 0U;
    ErrStatus ret = SUCCESS;
    uint32_t temp0 = 0U, temp1 = 0U, temp2 = 0U;

