RT-Thread-packages/gd32-arm-series/GD32H77x_78x/GD32H77x_78x_standard_peripheral/Source/gd32h77x_78x_cau_aes.c
    if(DISABLE == cau_enable_state_get()) {
        ret = ERROR;
    } else {
        for(i = 0U; i < in_length; i += BLOCK_DATA_SIZE) {
            /* wait until the IEM flag is set */
            while(RESET == cau_flag_get(CAU_FLAG_INFIFO_EMPTY)) {
            }

            if(i + BLOCK_DATA_SIZE >= in_length) {
                /* the last block data number is less than 128bit */
                uint32_t block_data_temp[4] = {0U};

                /* fill the remaining bits with zero */
                memcpy(block_data_temp, (uint32_t *)inputaddr, in_length - i);
                inputaddr = (uint32_t)block_data_temp;

                /* if GCM encryption or CCM decryption, then configurate NBPILB bits in CTL register */
                if((CAU_CTL & CAU_CTL_GCM_CCMPH) == CAU_ENCRYPT_DECRYPT_PHASE) {
                    if((CAU_CTL & (CAU_CTL_ALGM | CAU_CTL_CAUDIR)) == (CAU_MODE_AES_GCM | CAU_ENCRYPT)) {
                        CAU_CTL |= CAU_PADDING_BYTES(i + BLOCK_DATA_SIZE - in_length);
                    } else if((CAU_CTL & (CAU_CTL_ALGM | CAU_CTL_CAUDIR)) == (CAU_MODE_AES_CCM | CAU_DECRYPT)) {
                        CAU_CTL |= CAU_PADDING_BYTES(i + BLOCK_DATA_SIZE - in_length);
                    } else {
                    }
                }

                /* if CMAC encryption, then configurate NBPILB bits and CAU_CTL_CMACFB bit in CTL register */
                temp0 = CAU_CTL & CAU_CTL_GCM_CCMPH;
                temp1 = CAU_CTL & CAU_CTL_ALGM;
                temp2 = CAU_CTL & CAU_CTL_CAUDIR;
                if((CAU_AAD_PHASE == temp0) && (CAU_MODE_AES_CMAC == temp1) && (CAU_ENCRYPT == temp2)) {
                    CAU_CTL |= CAU_PADDING_BYTES(i + BLOCK_DATA_SIZE - in_length);
                    CAU_CTL |= CAU_CTL_CMACFB;
                }
            }

            /* write data to the IN FIFO */
            cau_data_write(*(uint32_t *)(inputaddr));
            inputaddr += 4U;
            cau_data_write(*(uint32_t *)(inputaddr));
            inputaddr += 4U;
            cau_data_write(*(uint32_t *)(inputaddr));
            inputaddr += 4U;
            cau_data_write(*(uint32_t *)(inputaddr));
            inputaddr += 4U;
        }
        /* wait until the complete message has been processed */
        counter = 0U;
        do {
            busystatus = cau_flag_get(CAU_FLAG_BUSY);
            counter++;
        } while((AESBSY_TIMEOUT != counter) && (RESET != busystatus));

        if(RESET != busystatus) {
            ret = ERROR;
        }
    }

    return ret;
}

/*!
    \brief      AES calculate process
    \param[in]  input: pointer to the input buffer
    \param[in]  in_length: length of the input buffer in bytes, must be a multiple of 16 bytes
    \param[out]  output: pointer to the returned buffer
    \retval     ErrStatus: SUCCESS or ERROR
*/
static ErrStatus cau_aes_calculate(uint8_t *input, uint32_t in_length, uint8_t *output)
{
    uint32_t inputaddr  = (uint32_t)input;
    uint32_t outputaddr = (uint32_t)output;
    uint32_t i = 0U;
    __IO uint32_t counter = 0U;
    uint32_t busystatus = 0U;
    ErrStatus ret = SUCCESS;

    /* the clock is not enabled or there is no embeded CAU peripheral */
    if(DISABLE == cau_enable_state_get()) {
        ret = ERROR;
    } else {
        for(i = 0U; i < in_length; i += BLOCK_DATA_SIZE) {
            /* wait until the IEM flag is set */
            while(RESET == cau_flag_get(CAU_FLAG_INFIFO_EMPTY)) {
            }

            /* check if the last input data block */
            if(i + BLOCK_DATA_SIZE > in_length) {
                /* the last block data number is less than 128bit */
                uint32_t block_data_temp[4] = {0};

                /* fill the remaining bits with zero */
                memcpy(block_data_temp, (uint32_t *)inputaddr, in_length - i);
                inputaddr = (uint32_t)block_data_temp;

                /* if GCM encryption or CCM decryption, then configurate NBPILB bits in CTL register */
                if((CAU_CTL & (CAU_CTL_ALGM | CAU_CTL_CAUDIR)) == (CAU_MODE_AES_GCM | CAU_ENCRYPT)) {
                    CAU_CTL |= CAU_PADDING_BYTES(i + BLOCK_DATA_SIZE - in_length);
                } else if((CAU_CTL & (CAU_CTL_ALGM | CAU_CTL_CAUDIR)) == (CAU_MODE_AES_CCM | CAU_DECRYPT)) {
                    CAU_CTL |= CAU_PADDING_BYTES(i + BLOCK_DATA_SIZE - in_length);
                } else {
                }
            }

            /* write data to the IN FIFO */
            cau_data_write(*(uint32_t *)(inputaddr));
            inputaddr += 4U;
            cau_data_write(*(uint32_t *)(inputaddr));
            inputaddr += 4U;
            cau_data_write(*(uint32_t *)(inputaddr));
            inputaddr += 4U;
            cau_data_write(*(uint32_t *)(inputaddr));
            inputaddr += 4U;

            /* wait until the complete message has been processed */
            counter = 0U;
            do {
                busystatus = cau_flag_get(CAU_FLAG_BUSY);
                counter++;
            } while((AESBSY_TIMEOUT != counter) && (RESET != busystatus));

            if(RESET != busystatus) {
                ret = ERROR;
                break;
            } else {
                /* read the output block from the output FIFO */
                *(uint32_t *)(outputaddr) = cau_data_read();
                outputaddr += 4U;
                *(uint32_t *)(outputaddr) = cau_data_read();
                outputaddr += 4U;
                *(uint32_t *)(outputaddr) = cau_data_read();
                outputaddr += 4U;
                *(uint32_t *)(outputaddr) = cau_data_read();
                outputaddr += 4U;
            }
        }
    }

    return ret;
}
